// Задача 5.7
// Дано n - размер матрицы. Пользуясь двумя циклами и одним ветвлением выведете на экран:

// формула диагональной матрицы:
// главная диагональ i=j
// побочная диагональ j = n - i + 1


// 1
let n = 10;
let flag = n - 1;

for (let i = 0; i < n; i++) {
    
	let str = ''
    for (let j = 0; j < n; j++) {
        
        if (j < flag) {
            str = str + "1";
        } else {
            str = str + "0";
        }
    }
    flag--;
	console.log(str);
}

/*
1111111110
1111111100
1111111000
1111110000
1111100000
1111000000
1110000000
1100000000
1000000000
0000000000
*/


// 2
let n = 10;
let flag = n - 1;  // 9

for (let i = 0; i < n; i++) {
    
	let str = ''
	
    for (let j = 0; j < n; j++) {
        
        if (j < n - flag) {
            str += "1";
        } else {
            str += "0";
        }
    }
    flag--;
	console.log(str);
	
}


/*
1 0 0 0 0 0 0 0 0 0
1 1 0 0 0 0 0 0 0 0
1 1 1 0 0 0 0 0 0 0
1 1 1 1 0 0 0 0 0 0
1 1 1 1 1 0 0 0 0 0
1 1 1 1 1 1 0 0 0 0
1 1 1 1 1 1 1 0 0 0
1 1 1 1 1 1 1 1 0 0
1 1 1 1 1 1 1 1 1 0
1 1 1 1 1 1 1 1 1 1
*/

