// Задание 8
// Дано n - размер матрицы. Выведете на экран шахматную доску:

let n = 10;

for (let i = 0; i < n; i++) {
    let str = ''
    
    for (let j = 0; j < n; j++) {
        if ((i + j) % 2) {
        str = str + "0";
    } 
    else {
        str = str + "1";
    }
    }
    console.log(str);
}

/*
1 0 1 0 1 0 1 0 1 0
0 1 0 1 0 1 0 1 0 1
1 0 1 0 1 0 1 0 1 0
0 1 0 1 0 1 0 1 0 1
1 0 1 0 1 0 1 0 1 0
0 1 0 1 0 1 0 1 0 1
1 0 1 0 1 0 1 0 1 0
0 1 0 1 0 1 0 1 0 1
1 0 1 0 1 0 1 0 1 0
0 1 0 1 0 1 0 1 0 1
*/