// Задача 5.9
// Дано n < 10 - размер матрицы. Выведете на экран:

/*
0 1 2 3 4 5 6 7 8 9
1 1 2 3 4 5 6 7 8 9
2 2 2 3 4 5 6 7 8 9
3 3 3 3 4 5 6 7 8 9
4 4 4 4 4 5 6 7 8 9
5 5 5 5 5 5 6 7 8 9
6 6 6 6 6 6 6 7 8 9
7 7 7 7 7 7 7 7 8 9
8 8 8 8 8 8 8 8 8 9
9 9 9 9 9 9 9 9 9 9
*/

let n = 10;
let flag = n - 1; 


for (let i = 0; i < n; i++) {
    let row = "";
    
    for (let j = 0; j < n; j++) {
        
        if (j < n - flag) {
            row += i + ' ';
        } else {
            row += j + ' ';
        }
    }
    flag--;
	console.log(row);
}


